app/controllers/spots_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "spots".* FROM "spots"
SELECT  "spots".* FROM "spots" LIMIT $1  [["LIMIT", 7]]
---
  def index
    @user = User.find(current_user.id)
    # puts("**********")
    # puts(@user.points)
    @spots = Spot.limit(@user.points)
    @spots_list = []
    @spots.each do |spot|

INSERT INTO "spots" ("time2leave", "latitude", "longitude", "created_at", "updated_at", "going", "user") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["points", 7], ["updated_at", "2022-12-14 21:30:44.379924"], ["id", 2]]
---
  def create
    @spot = Spot.new(spot_params)
    @spot.going = 0
    @spot.user = current_user.id
    respond_to do |format|
      if @spot.save
        format.html { redirect_to spot_url(@spot), notice: "Spot was successfully created." }
        format.json { render :show, status: :created, location: @spot }
        #add 1 point to user
        @user = User.find(current_user.id)
        @user.points = @user.points+1
        @user.save

UPDATE "spots" SET "going" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["going", 1], ["updated_at", "2022-11-17 03:40:36.352414"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @spot.update(spot_params)

DELETE FROM "spots" WHERE "spots"."id" = $1  [["id", 4]]
---
  def destroy
    @spot.destroy

UPDATE "spots" SET "going" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["going", 2], ["updated_at", "2022-11-18 05:48:54.188514"], ["id", 4]]
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "spots" SET "going" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["going", 2], ["updated_at", "2022-12-17 18:26:54.021556"], ["id", 2]]
---
  def add_going
    cur_id = session[:session_id]
    spot_id = params[:format]
    # spotValue = spot_id+cur_id
    spotValue = spot_id
    if session[:spots]==nil
      session[:spots]=Array.new
    end
    if session[:spots].include? spotValue
      redirect_to spots_url, notice: "You have already added it. "
    else
      session[:spots].push(spotValue)
      @spot = Spot.find(spot_id)
      @spot.going = @spot.going+1
      @spot.save

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_spot
      @spot = Spot.find(params[:id])