app/controllers/spots_controller.rb

    def set_spot
      @spot = Spot.find(params[:id])
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]