app/controllers/spots_controller.rb

UPDATE "spots" SET "going" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["going", 2], ["updated_at", "2022-11-17 04:36:57.696789"], ["id", 12]]
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def add_going
    cur_id = session[:session_id]
    spot_id = params[:format]
    # spotValue = spot_id+cur_id
    spotValue = spot_id
    if session[:spots]==nil
      session[:spots]=Array.new
    end
    if session[:spots].include? spotValue
      redirect_to spots_url, notice: "You have already added it. "
      # respond_to do |format|
      #   format.html { redirect_to spots_url, notice: "You have already added it." }
      #   format.json { head :no_content }
      # end
    else
      session[:spots].push(spotValue)
      @spot = Spot.find(spot_id)